{"pageProps":{"item":{"title":"Performing Solutions: A Dramatic Approach to Gun Violence Prevention (TH372)","publishDate":"2022-03-22T04:00:00.000Z","thumbnail":{"publicId":"tngvi/news/cl282l8jc00075ips22xi2xr6"},"thumbAltText":"Lighting on a stage form circular shapes on the ground.","body":{"document":[{"type":"layout","layout":[2,1],"children":[{"type":"layout-area","children":[{"type":"paragraph","children":[{"text":"Speaking with "},{"href":"https://www.emerson.edu/faculty-staff-directory/dana-edell","type":"link","children":[{"text":"Dana Edell","underline":true}]},{"text":", instructor of TH372 and assistant professor at Emerson College, helped shine a light on what studio courses are all about within the Transforming Narratives of Gun Violence initiative."}]},{"type":"paragraph","children":[{"text":"Dr. Edell is in her first year at Emerson, experiencing what it’s like to have classroom goals aligned with community-based social justice efforts in Boston and throughout the country. She has a history of activism and is interested in utilizing theater and production for change, healing, and community justice."}]},{"type":"paragraph","children":[{"text":"“I see my work here as being connected to the community, and I want to be supportive to those within it,” said Edell."}]},{"type":"paragraph","children":[{"text":"TH372 is a theater class, and students with all different majors can enroll and participate. Throughout the semester, students will create a production that challenges the current narratives surrounding gun violence. This production will be an addition to the greater media archive that all studio courses contribute to."}]},{"type":"paragraph","children":[{"text":"“We are creating an equitable partnership that reaches beyond the classroom,” said Edell. “The goal of community partners is to serve the larger initiative objectives while offering perspective and insight to students. And for the students, the goal for them is to be contributing to activist efforts in changing the way we talk about gun violence and gun violence prevention.”"}]},{"type":"paragraph","children":[{"text":"Each student will be able to utilize the class curriculum and apply it to their major, no matter what they are seeking their degree in."}]},{"type":"paragraph","children":[{"text":"“I don’t necessarily tailor the course to any major or any one field. Whether the student is a theater major or communications major, there will be opportunities to participate in the larger initiative. Just because a student is not acting, doesn’t mean they can’t contribute to the course in a meaningful way,” said Edell."}]},{"type":"paragraph","children":[{"text":"Edell also cited feeling a deep responsibility to survivors of gun violence."}]},{"type":"paragraph","children":[{"text":"“I am invested in creating a safe space for students and the folks we work with, that is gentle and trauma-informed, especially while reading and hearing about triggering topics,” she said. “I want to treat them all equally in the space, and investigate the issue together.”"}]},{"type":"paragraph","children":[{"text":"Edell’s class will showcase their performances at the end of April alongside the work of other studios in the Transforming Narratives of Gun Violence initiative. More information about the showcase will be shared soon."}]},{"type":"paragraph","children":[{"text":"Social impact studios are offered every semester, exploring narrative change alongside community partners through a variety of different lenses, including film, journalism, games, immersive media, and more."}]}]},{"type":"layout-area","children":[{"type":"heading","level":3,"children":[{"text":"Created With"}]},{"type":"paragraph","children":[{"text":""},{"href":"https://qa.transformnarratives.org/studios/th-315-performing-solutions-a-dramatic-approach-to-gun-violence-prevention/","type":"link","children":[{"text":"TH372"}]},{"text":""}]},{"type":"heading","level":3,"children":[{"text":"Author"}]},{"type":"paragraph","children":[{"text":"Destiny Murray, intern"}]},{"type":"heading","level":3,"children":[{"text":"Contact"}]},{"type":"paragraph","children":[{"text":"desciszewski@gmail.com"}]}]}]},{"type":"paragraph","children":[{"text":""}]}]}},"relatedItems":null},"__N_SSG":true}