{"pageProps":{"page":{"values":{"document":[{"type":"heading","level":4,"children":[{"text":"Our Values"}]},{"type":"heading","level":5,"children":[{"text":"Anti-racism"}]},{"type":"paragraph","children":[{"text":"From its inception and throughout history, gun violence has been used in the United States to eliminate, control, and oppress Black, Indigenous, and People of Color, and to promote white supremacy. Still today we see racial disparities in gun-related homicide and police brutality, indicating that BIPOC individuals and communities are still disproportionately impacted by gun violence. Furthermore, stories about gun violence often perpetuate negative stereotypes of BIPOC individuals and communities. It is impossible to address the issue of gun violence and transform harmful narratives without recognizing the historical and on-going effects of racism. We commit to careful, collaborative examination of racism as a root cause of gun violence. We commit to working alongside BIPOC individuals and communities to promote anti-racist narratives, and to create media and art that is anti-racist."}]},{"type":"heading","level":5,"children":[{"text":"\nDe-politicization & Re-humanization "}]},{"type":"paragraph","children":[{"text":"Like many issues today, narratives about gun violence are often framed to promote certain political ideals and further political objectives. The politicization of gun violence is often at the expense of those directly impacted. We commit to re-centering human experience and aim to avoid politicization."}]},{"type":"heading","level":5,"children":[{"text":"\nCo-creation & Co-design "}]},{"type":"paragraph","children":[{"text":"We commit to create and design "},{"text":"with","italic":true},{"text":" those who are most impacted by gun violence. This usually means that community participants work directly alongside students in a shared learning and creating space. We value the time, expertise, and agency of individuals closely impacted by gun violence and commit to creating spaces that uplift and empower."}]},{"type":"heading","level":5,"children":[{"text":"\nAsset Framing"}]},{"type":"paragraph","children":[{"text":"Asset framing is about defining people by their assets and aspirations before noting their challenges and deficits. We commit to asset-framing as a model for our co-creation work with Boston communities, focusing on what individuals and communities "},{"text":"have, ","italic":true},{"text":"not only what they "},{"text":"lack.","italic":true}]}]}},"people":[{"name":"Alexandra Chery-Dorrelus","title":"Co-Executive Director, Louis D. Brown Peace Institute","blurb":"My brother was murdered in 1993. We are more than gun violence victims. TNGV is providing an opportunity to share the full story. Issues of violence don't start with the gun, the gun is a weapon of choice. When we transform the narrative, we remove the stigma, shame, blame and guilt.","remembrance":"Louis D. Brown, 4/13/1978-12/21/1993","image":{"publicId":"tngvi/people/cl3d75web0001rkpsgloke3m2"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Angelina Gu","title":"Project Intern, Boston Children's Hospital SIMPeds Simulator Program","blurb":"As an Emerson media art student, I’ve always tried to make a difference where I can. Interning at BCH SIMPeds, I help medical professionals improve technical skills through simulation. Participating in Emerson Prison Initiative, I help formerly incarcerated fathers tell their stories. TNGV is an incredible opportunity for me to help by combining my passion in healthcare and social impact media art. I get to collaborate with those directly impacted by gun violence, to hear their stories of their loved ones, and to be part of their healing journey; I’m forever grateful to have this experience.","remembrance":"","image":{"publicId":"tngvi/people/cl4758x290000qjpsdyjm4ed3"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Anna Porter","title":"Administrative Coordinator, MGH Center for Gun Violence Prevention","blurb":"When I was in high school, active shooter drills were just becoming common. While I grew up and attended school in a very safe district, I was plagued by anxiety and fear surrounding gun violence due to these drills. Additionally, while gun violence has not taken anyone from my life directly, I continue to meet people who are impacted by it every day. My friend's father was murdered by gunshot. A family friend's father took his own life by gun. I believe that we need to rethink the way we can mitigate gun violence and make our communities safer. I believe we need to tell the untold stories of gun violence and lift up unheard voices. I believe we need to depoliticize the conversation around guns if anything is going to get better. These reasons mark why I am involved in TNGV. ","remembrance":"","image":{"publicId":"tngvi/people/cl28e11pf001a5ipsdqpb055u"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Carla Sheffield","title":"Co-Founder & Executive Director, Better Opportunities, Inc","blurb":"Gun violence has changed my whole life and not necessarily for the better. I had to redefine who I am as a person, a woman, a mother and a survivor in order to move forward in this forced journey. ","remembrance":"Burrell Anthony Ramsey, 8/11/1986 - 8/21/2012","image":{"publicId":"tngvi/people/cl28bzf3c000e5ipsfw4n7ews"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Chana Sacks","title":"Co-Director, MGH Center for Gun Violence Prevention","blurb":"As a doctor and cousin, I have witnessed the pain wrought by gun violence. That is why I am honored to be part of this team: Transforming Narratives of Gun Violence offers a path to explore creative, novel approaches to tackling this crisis that has devastated so many families. This collaboration is grounded in the knowledge that a new way forward is possible – if we are bold enough to create it together.","remembrance":"Daniel Barden, 9/27/2005 - 12/14/2012","image":{"publicId":"tngvi/people/cl28bzmvw000f5ipsbeywfpix"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Chaplain Clementina Chery","title":"President & CEO, Louis D. Brown Peace Institute","blurb":"This is a partnership that is needed in order to transform the narrative of gun violence.","remembrance":"Louis D. Brown, 4/13/1978-12/21/1993","image":{"publicId":"tngvi/people/cl3d7o4ox000001bg632v5a7p"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Chloe Williams","title":"Visual Designer, Engagement Lab at Emerson College","blurb":"I’m the visual designer for the Engagement Lab and have worked with the TNGV website, creating the aesthetics and illustrations for the initiative.","remembrance":"","image":{"publicId":"tngvi/people/cl28bzuc1000g5ips13df5shv"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Cole Tatham","title":"Fellow, MGH Center for Gun Violence Prevention","blurb":"I want to use the film production skills I learned at Emerson to help tell the stories of those impacted by gun violence in Boston.","remembrance":"","image":{"publicId":"tngvi/people/cl5b5ifj1000033psf2149djh"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Dana Edell","title":"Assistant Professor, Emerson College","blurb":"I am involved in TNGV because I am passionate about dismantling racism and inspiring theatre students to learn about and create social justice-based performances that directly impact our communities in meaningful ways. I have seen how guns have torn apart the families of people I love along with dozens and dozens of the teenagers I have collaborated with through my theater work. I recognize the ways that people acquire and use guns in the US as a vicious epidemic that causes such harm and rupture across every community. The dysfunctions in our racist legal, education, criminal justice, health and social services systems in the US have all contributed to the violence in our communities. I am involved in TNGV because I want to be part of a coalition to work to reframe the narratives, stereotypes and misunderstandings that have paved the way for gun violence to get out of control. I want my creative, academic, and activist work to all be about collaborating with those most impacted in order to find and implement solutions. ","remembrance":"","image":{"publicId":"tngvi/people/cl28c0405000h5ips6pxla0p3"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Destiny Murray","title":"Project Assistant, Engagement Lab at Emerson College","blurb":"I watched my brother struggle with survivor’s guilt and a lost identity after a mass shooting. I watched my best friend lose sight of her faith, as a member of her youth group at church was lost in the same shooting. I watched organizers overseas march in solidarity with the city I hold so close to my heart, over the same tragedy. And to this day, that wound remains open in Orlando. So if we don’t do something about this, who will?","remembrance":"the 49 lives lost at Pulse Nightclub, 6/12/2016","image":{"publicId":"tngvi/people/cl28c0ca9000i5ips1aft8j6z"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Elaina DeStefano","title":"Growth and Sustainability Manager, Louis D. Brown Peace Institute","blurb":"","remembrance":"","image":{"publicId":"tngvi/people/cl3d1ypfv00027ypsehjr0ruf"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Eric Gordon","title":"Director & Professor, Engagement Lab at Emerson College","blurb":"Gun violence has impacted me as it has everyone. It permeates every corner of our society, and many of us have become experts at ignoring it, while other have had to normalize it. I am motivated to bring new stories to our collective attention and change the local and national conversation. That's the only way that policies and norms will change.","remembrance":"","image":{"publicId":"tngvi/people/cl28c0mf3000j5ips78kne64m"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Grace Fu","title":"Graduate Assistant, Engagement Lab at Emerson College","blurb":"As an international student who did not grow up here, gun violence originally sounded like something far away from me. But since I started my higher education here, I realize it's not as far away as I'd thought. In order to connect with society in a deeper way, I decided to get involved and make a difference. ","remembrance":"","image":{"publicId":"tngvi/people/cl28c480w000k5ips9b4n4xqo"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Gretchen Felopulos","title":"Education & Training Lead, MGH Center for Gun Violence Prevention","blurb":"As a parent, child psychologist, and person living in the U.S., I feel I have a personal and professional responsibility to work toward ending gun violence while supporting those who have been affected by it. I am involved with TNGV through my education role with the MGH Center for Gun Violence Prevention and hope to be a more active participant in this amazing program, especially related to expanding collaborations with community-based youth organizations and K-8th grade schools in Boston. ","remembrance":"all lives lost and forever changed due to gun violence","image":{"publicId":"tngvi/people/cl28c4jln000l5ipsd0ajaxye"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Janice V. Johnson","title":"Healing Support Services Manager, Louis D. Brown Peace Institute","blurb":"It’s important for me to be a part of the solution so Generation Peace who consist of the young leaders, world shakers and change makers. They are our children, young activists, college students and neighbors that look up to us to model peace as we respond to murder, trauma, grief and loss. ","remembrance":"","image":{"publicId":"tngvi/people/cl3d1x4me00017yps8o2g8a6y"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Johnny Richardson","title":"Lead Developer, Engagement Lab at Emerson College","blurb":"I developed the TNGVI website. I am passionate about work centering around using games and web tech to help solve problems in democracy and governance, global health, media literacy, racial and income equity, and accessibility.","remembrance":"","image":{"publicId":"tngvi/people/cl26as2kz000744ps6y2ea7lp"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"John Yang","title":"Student, Emerson College","blurb":"Gun violence changed my life as it is the main reason why I was displaced from my community. I am involved in TNGV because I want to be part of the necessary change needed to allow people from under-privileged communities a better opportunity to illuminate the accuracies of their stories being told.","remembrance":"","image":{"publicId":"tngvi/people/cl28c4smg000m5ips75v40chx"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"LeeAnn Taylor","title":"Mother","blurb":"To get information about gun violence","remembrance":"my son Daniel P. Taylor, 7/21/1990-2/23/2014","image":{"publicId":"tngvi/people/cl28c5d8f000n5ips85wz39z1"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Marly Kaufman","title":"Student, Emerson College","blurb":"I am thrilled to be on a team so motivated to shift the detrimental narratives that swarm the media daily. I am a visual designer responsible for editing the video content for the Engagement Lab. Living 15 miles from Stoneman Douglas High School, where a mass shooting occurred, I was impacted and became passionate about gun violence affecting my community. ","remembrance":"","image":{"publicId":"tngvi/people/cl2tdxz140002i2psabudgh4w"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Nicole Simon","title":"Student, Emerson College","blurb":"","remembrance":"","image":{"publicId":"tngvi/people/cl4cvjlh00001qjpsh53043rq"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Peter Masiakos","title":"Pediatric Surgeon & Co-Director, MGH Center for Gun Violence Prevention","blurb":"For nearly 30 years, I have cared for many victims of gun violence.  I feel that doctors can no longer point and say that gun violence is a public health epidemic without engaging those who are affected most - the survivors, whose credible voices and stories often go unheard.  Everyone has a story to tell and we all have to do our best to listen.  This is why I am a part of TGNV.","remembrance":"","image":{"publicId":"tngvi/people/cl28c5qb5000o5ips1ma3cmnw"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Rachele Gardner","title":"Manager of Strategic Partnership and Civic Impact, Engagement Lab at Emerson College","blurb":"My neighborhood is highly impacted by gun violence. In my years working with youth in Dorchester, I was saddened by how normalized shootings, and even gun deaths, had become to them. I am involved in TNGV because violence should never be \"normal\" and the youth in my community deserve better. I am compelled to transform the narrative of gun violence by lifting up those who are working toward peace.","remembrance":"young people in my neighborhood who have been killed by gun violence","image":{"publicId":"tngvi/people/cl28c5zje000p5ipsa9f7hgb5"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Sabrina Carr","title":"Student, Emerson College","blurb":"Gun Violence has impacted me because as a student in elementary, middle school, and high school, I remember hearing about countless mass shootings in schools where children my age were innocently murdered. I remember being terrified to go to class and worried that the same thing might happen to me. Being part of this studio course has opened my eyes to the amount of lives gun violence can impact. It tears communities and families apart, and I am excited to be part of a project that can hopefully empower people to be part of the change. ","remembrance":"","image":{"publicId":"tngvi/people/cl28c6a2h000q5ips5lcgc2ae"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Sharry Li","title":"Thesis Project Graduate Student, Emerson College","blurb":"My thesis project aims to bring more social awareness to college students about gun violence in underprivileged communities in the Greater Boston area. I began this project as a part of the three-year collaborative initiative between Emerson College, Massachusetts General Hospital, and Louis D. Brown Peace Institute. Throughout this project, I have realized a gap between college students’ education and the needs of Greater Boston’s local communities. Thus, my goal for this thesis project is to create a structure/tool to support and assist college students in Boston in anti-gun violence activism.","remembrance":"","image":{"publicId":"tngvi/people/cl28c6jtf000r5ipsfjxe2lmz"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Shaulita Francis","title":"Communication and Marketing Manager, Louis D. Brown Peace Institute","blurb":"Gun violence has plagued my community. This epidemic has been used to paint the story of my community with no acknowledgment for the assets that exist within it. ","remembrance":"","image":{"publicId":"tngvi/people/cl28c6rbz000s5ipsdl837bni"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}},{"name":"Theodore \"Regge\" Life","title":"Senior Distinguished Director in Residence, Emerson College","blurb":"I was very inspired when Eric Gordon shared his intentions to offer this class and reached out to the faculty of the Visual and Media Arts department.","remembrance":"","image":{"publicId":"tngvi/people/cl28c6zfw000t5ips1ahndu3y"},"content":{"document":[{"type":"paragraph","children":[{"text":""}]}]}}]},"__N_SSG":true}