{"pageProps":{"item":{"title":"TH372: Showcase Performance","filters":[{"name":"Spring 2022","key":"spring-2022","enabled":true},{"name":"Performing Arts","key":"performing-arts","enabled":true},{"name":"Peace Institute","key":"peace-institute","enabled":true},{"name":"Video","key":"video","enabled":true}],"content":{"document":[{"type":"layout","layout":[2,1],"children":[{"type":"layout-area","children":[{"type":"paragraph","children":[{"text":"As a culminating project scaffolded throughout the semester, students created and performed an original theater piece, inspired by their experiences throughout the term. At the beginning of our process, we brainstormed a long list of all the ways the dominant narratives of guns in the United States are misleading, false, harmful and dangerous. Students were then placed into small groups of 2-3 based on their interests in how to use theater to transform these hegemonic narratives. Each small group created a short 5-12 minute performance exploring one specific storyline or thematic area. These pieces included a sermon series from the voice of a young pastor struggling with how to talk to his community in the aftermath of yet another violent shooting. Another piece placed two young women together: one whose father was killed by a gun shot by the other’s father as they shared their grief with each other. Another piece illuminated how the impact of one act of gun violence in a school ripples out into the community forever changing the lives of a teacher, a friend, a parent. A poetic piece braided stories and feelings related to survival and its weight, impossibility and hope. And the last piece presented a poem about the experience of young Black people moving through public spaces with fear. As we imagined how to share all of this creative work in a 5 minute excerpt, we created a loose, fractured frame of a subway car with each stop declaring one of the principles of peace from the Louis D. Brown Peace Institute, a framework that deeply inspired us. So as the train stopped at “Hope Street,” and “Faith Street,” students shared provocative lines from their work related to each principle. The performance culminated at “Unity Street,” where the “train” opened up, and the students performed the final poem, inviting the audience to breathe with them as we walk through the world, in fear and in hope."}]},{"type":"paragraph","children":[{"text":"We followed the performance with a discussion with Dr. Shari Rafferty, one of the community members from the Peace Institute who had visited and shared her stories with our class earlier in the semester and was one of the inspirations for the performance. Students shared their feelings about the course, the semester and how this work had impacted them."}]}]},{"type":"layout-area","children":[{"type":"heading","level":3,"children":[{"text":"Performers"}]},{"type":"paragraph","children":[{"text":"Allie Witek"}]},{"type":"paragraph","children":[{"text":"Allison Earl"}]},{"type":"paragraph","children":[{"text":"Demiah Crawford"}]},{"type":"paragraph","children":[{"text":"Ethan Williams"}]},{"type":"paragraph","children":[{"text":"Juliette Hoernle"}]},{"type":"paragraph","children":[{"text":"Kylie Berry"}]},{"type":"paragraph","children":[{"text":"Lee Forrest"}]},{"type":"paragraph","children":[{"text":"Maia Tivony"}]},{"type":"paragraph","children":[{"text":"McKennen Campbell"}]},{"type":"paragraph","children":[{"text":"Mikayla Brown"}]},{"type":"paragraph","children":[{"text":"Rachel Tabin"}]},{"type":"paragraph","children":[{"text":"Tiana Perez-Toro"}]},{"type":"paragraph","children":[{"text":"Tori Eriavez"}]}]}]},{"type":"paragraph","children":[{"text":""}]}]},"videos":[{"label":"TH315: Showcase Performance","thumb":"https://i.vimeocdn.com/video/1450218687-03bdc3fb0a220f5e0489b51bc836a72f7db6c158eaeed6bbc08d95b60aacc1ba-d_1920x1080?r=pad","value":"https://player.vimeo.com/video/719880309?h=24d94eb024","caption":"TH315: Showcase Performance","thumbSm":"https://i.vimeocdn.com/video/1450218687-03bdc3fb0a220f5e0489b51bc836a72f7db6c158eaeed6bbc08d95b60aacc1ba-d_200x150?r=pad"}],"thumbnail":{"publicId":"tngvi/media/cl4ef6bp80002qjpseo8acr56"}},"relatedItems":[]},"__N_SSG":true}