{"pageProps":{"item":{"title":"VM495: Turning Pain into Purpose","publishDate":"2022-02-04T05:00:00.000Z","thumbnail":{"publicId":"tngvi/news/cl283coov00095ipse0rq1lk4"},"thumbAltText":"Candid photo of class participants involved in discussion.","body":{"document":[{"type":"layout","layout":[2,1],"children":[{"type":"layout-area","children":[{"type":"paragraph","children":[{"text":"There are at least two sides to every story. But what happens when a specific side of the story is silenced? For example, the tortoise would have no purpose for his race without the hare’s side of the story. The hare’s overconfidence creates an arena for the tortoise’s slow and efficient pace to win the race. Without the hare, the narrative of the race is not complete. The hare is important to show how interrelationships impact others in a community. Yet, when the media reports on gun violence it doesn’t give us all the information. The only information divulged is how many shots were fired, how many were injured or dead. This is attention-grabbing breaking news, and it has become the dominant narrative of gun violence. However, this isn’t the whole story. Gun violence destroys families and communities. Understanding how this happens is the focus of a new documentary film course at Emerson College."}]},{"type":"paragraph","children":[{"text":"VM495: Film Production taught by Professors Theodore Life and Eric Gordon, is part of the Engagement Lab’s Transforming Narratives of Gun Violence initiative, a partnership with Massachusetts General Hospital’s Center for Gun Violence Prevention and The Louis D. Brown Peace Institute."}]},{"type":"paragraph","children":[{"text":"The first several weeks of the course focused on sharing stories of gun violence, loss, and healing. Intimate dialogues between the five community auditors and enrolled students are laying the foundation for the creative collaboration that will structure the course. What emerged so far is a resounding belief that gun violence impacts more than just the person shot and the person doing the shooting. The harm extends to family members, friends, and neighbors. It generates pervasive anxiety and sadness that is extremely difficult to overcome. Even then, it is difficult to remove the social stigma and assumptions that prioritize certain victims over others; that mourn the loss of white lives and ignore the loss of others’ lives."}]},{"type":"paragraph","children":[{"text":"The class now proceeds forward, exploring together how to “turn pain into purpose” — a mission set forth last week by community partner Carla Sheffield who"},{"href":"https://www.live4bo.com/","type":"link","children":[{"text":"seeks to bring meaning from the tragic loss of her son"}]},{"text":". The class is exploring how virtual reality (VR) and 360 videos may help Carla and other people changed by gun violence, express their purpose and their pain. VR is sometimes called an "},{"href":"https://www.ted.com/talks/chris_milk_how_virtual_reality_can_create_the_ultimate_empathy_machine?language=en","type":"link","children":[{"text":"empathy machine"}]},{"text":" and the class is invested in the technology’s ability to create compassion. Compassion literally means to suffer with. Perhaps, if society suffers together then people may be able to heal together. As Cole Tatham, one of the students in the class, said: “We need to tell nuanced and full stories of survivors rather than reducing them to their pain.”"}]}]},{"type":"layout-area","children":[{"type":"heading","level":3,"children":[{"text":"Created With"}]},{"type":"paragraph","children":[{"text":""},{"href":"https://qa.transformnarratives.org/studios/vm-495-documentary-studio/","type":"link","children":[{"text":"VM495"}]},{"text":""}]},{"type":"heading","level":3,"children":[{"text":"Author"}]},{"type":"paragraph","children":[{"text":"John Yang, student"}]},{"type":"heading","level":3,"children":[{"text":"Contact"}]},{"type":"paragraph","children":[{"text":"john_yang@emerson.edu"}]}]}]},{"type":"paragraph","children":[{"text":""}]}]}},"relatedItems":null},"__N_SSG":true}