{"pageProps":{"item":{"title":"A Reflection on Todd Chandler's Bulletproof","publishDate":"2022-03-22T04:00:00.000Z","thumbnail":{"publicId":"tngvi/news/cl282kzye00065ips2ebu5knc"},"thumbAltText":"Rows of student desks in a classroom.","body":{"document":[{"type":"layout","layout":[2,1],"children":[{"type":"layout-area","children":[{"type":"paragraph","children":[{"text":"In a time where schools have stepped up efforts to protect against mass shootings, "},{"href":"https://grasshopperfilm.com/film/bulletproof/","type":"link","children":[{"text":"Bulletproof","underline":true}]},{"text":", a film directed by Todd Chandler, provides a window into the complexity of security and safety measures within school systems in the U.S. Bulletproof was screened at the Paramount Theater in Boston on February 17th, as part of the BrightLights film series and co-sponsored by the Engagement Lab. The screening was immediately followed by a panel discussion with the film’s director and Dr. Chana Sacks, co-director of the Center for Gun Violence Prevention at Mass General Hospital."}]},{"type":"paragraph","children":[{"text":"The film does not take an explicit stance on the issue of school security and active shooter drills, but instead exposes the viewer to teachers, administrators, students, and school communities as they themselves wrestle with the issue of school safety, take active measures, or go through the preparatory motions, much like they do in preparation for other school events like homecoming. In the end, the viewer is left to interpret the cost-benefit of this movement of society toward “preparedness” for themselves."}]},{"type":"paragraph","children":[{"text":"In the beginning of the film, the audience meets a young woman taking a course in the proper use of a firearm. As she learns what to do when facing an active shooter in different contexts and at different distances, she details her need for this training as refusing to lose a single one of her young elementary-age students to tragedy on campus."}]},{"type":"paragraph","children":[{"text":"In one of the more striking visuals in the film we see a conference, where booths are set up and representatives from different companies are pitching their unique “school safety” products to consumers. In this case, the consumers are school board members and administrators, and the products sold are softwares and technologies that better equip schools to handle worst-case-scenarios — things like bulletproof desks and whiteboards. As school principals contemplate the fate of their young students in the case that an active shooter makes it into their building, we see two women dressed as show-girls, hoping to catch people’s attention with their fluffy yellow feathers and jeweled outfits."}]},{"type":"paragraph","children":[{"text":"In another series of shots, we see students of varying ages in an urban school setting. A middle school teacher debriefs with students after an active shooter drill where the class is seen huddled into a corner of the room until the loud speaker indicates the drill is over. The math teacher uses probability to explain to his class that the chances of experiencing an active shooter on campus are next to none. A young boy expresses that the drills are worse for his anxiety than if an actual incident were to happen. A young girl describes her fear after witnessing tragic school shooting events broadcasted all over social media. Another student shares that she is more scared that an ICE raid will end in parent deportation. This conversation is contrasted with a series of shots of students of varying ages practicing mindfulness activities, calming their inner worlds in preparation for daily learning. The viewer is left to wonder which practices are truly promoting peace and safety of the students."}]},{"type":"paragraph","children":[{"text":"In the discussion that followed, Chandler drew attention to the deep cultural roots of violence in American history. “Our country’s ideals were born out of the battle for freedom and the ‘necessity’ of having the right to bear arms,” said Chandler. In a country founded through the slaughter of indigenous people, built dependent on the forceful capture and enslavement of African people, and established through bloody battles for revolutionary freedom, it’s no surprise that violence is ingrained in our society and that we turn to these tools for “safety.” And his film calls us to consider the impact on our youngest members of society when even the place of greatest safety — our schools — are treated as potential battlegrounds."}]},{"type":"paragraph","children":[{"text":"Chana Sacks, co-director of the Center for Gun Violence Prevention at Massachusetts General Hospital, implored the audience to look to the science. School shootings are far less frequent than the media leads us to believe. And furthermore, we have no evidence to support the efficacy of active shooter preparedness drills, and no studies on the psychological effects of these drills on students."}]},{"type":"paragraph","children":[{"text":"Although Chandler has received some criticism by activists who wanted the message of the film to be more politically direct and in line with their anti-gun agenda, the film has been received incredibly well over all, according to Chandler. In agreement, several members voiced their appreciation of the film’s spirit of inquiry and encouragement of the viewer to think about the different perspectives and form their own opinion."}]},{"type":"paragraph","children":[{"text":"You can watch Bulletproof and come to your own conclusion "},{"href":"https://www.pbs.org/independentlens/documentaries/bulletproof/","type":"link","children":[{"text":"here","underline":true}]},{"text":"."}]}]},{"type":"layout-area","children":[{"type":"heading","level":3,"children":[{"text":"Author"}]},{"type":"paragraph","children":[{"text":"Destiny Murray, intern"}]},{"type":"heading","level":3,"children":[{"text":"Contact"}]},{"type":"paragraph","children":[{"text":"desciszewski@gmail.com"}]}]}]},{"type":"paragraph","children":[{"text":""}]}]}},"relatedItems":null},"__N_SSG":true}