{"pageProps":{"item":{"title":"Promoting Peace Through the Power of the People","publishDate":"2022-03-24T04:00:00.000Z","thumbnail":{"publicId":"tngvi/news/cl2ajzbds0002h8ps74rl8cre"},"thumbAltText":"The cast of Teen Empowerment's film, Senseless Smoke.","body":{"document":[{"type":"layout","layout":[2,1],"children":[{"type":"layout-area","children":[{"type":"paragraph","children":[{"text":"","underline":true},{"href":"https://teenempowerment.org/senseless-smoke/","type":"link","children":[{"text":"Senseless Smoke","underline":true}]},{"text":" is a movie created to uplift unheard voices of those affected by gun violence in places that have become silent in how their stories are told. This is a film written, created, and starred by staff and youth from the Center for Teen Empowerment in Roxbury. The youth, having been exposed themselves to the effects of violence within their communities, bring authenticity to the characters and voices, both raising awareness of the systemic conditions that allow gun violence to take root, and also demonstrating the power within the community to transform itself and bring peace. The film exposes and critiques the systems that perpetuate conditions of mass incarceration, the school-to-prison pipeline, and gangs that continue to challenge black and brown communities’ ability to thrive, while also calling the same communities to collective action. These young actors and actresses displayed incredible courage, strength, and talent as they immersed themselves in the complex characters and conditions of the film, much to the benefit of viewers."}]},{"type":"paragraph","children":[{"text":"Teen Empowerment created this film as part of its anti-violence arts advocacy programming. As such, they create viewing experiences of the film that include post-viewing “talkbacks” with the youth cast to go deeper into some of the themes and content with the audience. Recently, the Elma Lewis Center hosted a viewing and talkback with Teen Empowerment at Emerson. This recent interaction at Emerson of having creators, actors, students, professors and community members engaging in a single conversation about gun violence was extraordinary — a process in which questions and answers come from those voices of our community dealing directly with and most affected by gun violence. As Emerson students engaged in discussion with the youth cast of the film, there was a genuine curiosity to better understand the youths’ perspectives of the problem. This is a critical first step to being allies in the work of social change and healing. And one we’re committed to as students in the Transforming Narratives of Gun Violence initiative."}]},{"type":"paragraph","children":[{"text":"During the talkback following the film, someone in the Emerson audience asked the youth actors and adult staff to speak to their experiences making the film and entering into their characters. Robert, the films’ director, and art director at Teen Empowerment spoke about supporting each actor and actress’ unique process of stepping outside of themselves to take on their character, to reflect, and then provide what is needed to fulfill a desired mood or characteristic that might not come naturally. Helping the youth grow as actors and bring their characters to life on the screen was his biggest success. One of the young male actors described his process, explaining that he had to set himself aside from the others and enter into a real dark place in his mind to fulfill his role in the film. One of the young actresses who played an elder in the community, “triple her age,” said that the film gave her a reason to spend more time with her grandmother to enter into the mindset of an elder. In doing so, she said that she learned that many of the issues they are dealing with today as teens, their elders also dealt with, just in slightly different forms, void of technology. When asked what they learned from their characters, another actor answered that he learned from his character’s ability to transition from being part of the problem to part of the solution — we all have a role to play. When asked if there would be a sequel to the film? They were all hopeful, provided there were resources to support its production."}]},{"type":"paragraph","children":[{"text":"For any who have not yet viewed the film and experienced a talkback with the youth cast, we recommend you take the next opportunity to do so. Teen Empowerment is creating authentic spaces for all to engage with the complex issues related to gun violence and to see themselves as part of the solution to transform the narrative. As the young actor suggested, if stepping outside of yourself and into a dark place allows you the development needed to create the best results, then this film shows us exactly where this dark place is, and it is not one void of hope."}]}]},{"type":"layout-area","children":[{"type":"heading","level":3,"children":[{"text":"Created With"}]},{"type":"paragraph","children":[{"text":""},{"href":"https://transformnarratives.org/studios/vm-495-documentary-studio/","type":"link","children":[{"text":"VM495"}]},{"text":""}]},{"type":"heading","level":3,"children":[{"text":"Author"}]},{"type":"paragraph","children":[{"text":"John Yang, student"}]},{"type":"heading","level":3,"children":[{"text":"Contact"}]},{"type":"paragraph","children":[{"text":"john_yang@emerson.edu"}]}]}]},{"type":"paragraph","children":[{"text":""}]}]}},"relatedItems":null},"__N_SSG":true}